PenguinEino/arduino-xiao-atmega328pb/avr/boards.txt
menu.BOD=Brown-out detection
menu.eeprom=EEPROM
menu.LTO=Compiler LTO
menu.bootloader=Upload method

xiao328pb.name=ATmega Gokan XIAO (ATmega328PB, 16 MHz)
xiao328pb.build.core=MiniCore:MCUdude_corefiles
xiao328pb.build.variant=xiao328pb
xiao328pb.build.board=AVR_XIAO_ATMEGA328PB
xiao328pb.build.mcu=atmega328pb
xiao328pb.build.f_cpu=16000000L
xiao328pb.build.extra_flags=
xiao328pb.upload.tool=MiniCore:avrdude
xiao328pb.upload.speed=115200
xiao328pb.upload.maximum_data_size=2048
xiao328pb.bootloader.tool=MiniCore:avrdude
xiao328pb.bootloader.unlock_bits=0xff
xiao328pb.bootloader.lock_bits=0xff
xiao328pb.bootloader.low_fuses=0xff

xiao328pb.menu.bootloader.uart0=USB serial (UART0 / Urboot)
xiao328pb.menu.bootloader.uart0.upload.maximum_size=32384
xiao328pb.menu.bootloader.uart0.upload.protocol=urclock
xiao328pb.menu.bootloader.uart0.build.export_merged_output=true
xiao328pb.menu.bootloader.uart0.bootloader.file=urboot/atmega328pb/watchdog_1_s/autobaud/uart0_rxd0_txd1/no-led/urboot_atmega328pb_pr_ee_ce.hex
xiao328pb.menu.bootloader.isp=ISP (no bootloader)
xiao328pb.menu.bootloader.isp.upload.maximum_size=32768
xiao328pb.menu.bootloader.isp.build.export_merged_output=false
xiao328pb.menu.bootloader.isp.bootloader.file=empty/empty.hex

xiao328pb.menu.BOD.2v7=2.7V (MiniCore default)
xiao328pb.menu.BOD.2v7.bootloader.extended_fuses=0xf5
xiao328pb.menu.BOD.4v3=4.3V
xiao328pb.menu.BOD.4v3.bootloader.extended_fuses=0xf4
xiao328pb.menu.BOD.disabled=Disabled
xiao328pb.menu.BOD.disabled.bootloader.extended_fuses=0xf7
xiao328pb.menu.eeprom.keep=Retain
xiao328pb.menu.eeprom.keep.bootloader.high_fuses=0xd7
xiao328pb.menu.eeprom.erase=Erase
xiao328pb.menu.eeprom.erase.bootloader.high_fuses=0xdf
xiao328pb.menu.LTO.enabled=Enabled
xiao328pb.menu.LTO.enabled.compiler.c.extra_flags=-Wextra -flto -g
xiao328pb.menu.LTO.enabled.compiler.c.elf.extra_flags=-w -flto -g
xiao328pb.menu.LTO.enabled.compiler.cpp.extra_flags=-Wextra -flto -g
xiao328pb.menu.LTO.enabled.ltoarcmd=avr-gcc-ar
xiao328pb.menu.LTO.disabled=Disabled
xiao328pb.menu.LTO.disabled.compiler.c.extra_flags=
xiao328pb.menu.LTO.disabled.compiler.c.elf.extra_flags=
xiao328pb.menu.LTO.disabled.compiler.cpp.extra_flags=
xiao328pb.menu.LTO.disabled.ltoarcmd=avr-ar
